grodansparadis/vscp-firmware/pic/common/PIC18_ECAN/p18f2585_mod.h
extern volatile far  unsigned char       RXFBCON5;
extern volatile far  struct {
  unsigned F10BP_0:1;
  unsigned F10BP_1:1;
  unsigned F10BP_2:1;
  unsigned F10BP_3:1;
  unsigned F11BP_0:1;
  unsigned F11BP_1:1;
  unsigned F11BP_2:1;
  unsigned F11BP_3:1;
} RXFBCON5bits;
extern volatile far  unsigned char       RXFBCON6;
extern volatile far  struct {
  unsigned F12BP_0:1;
  unsigned F12BP_1:1;
  unsigned F12BP_2:1;
  unsigned F12BP_3:1;
  unsigned F13BP_0:1;
  unsigned F13BP_1:1;
  unsigned F13BP_2:1;
  unsigned F13BP_3:1;
} RXFBCON6bits;
extern volatile far  unsigned char       RXFBCON7;
extern volatile far  struct {
  unsigned F14BP_0:1;
  unsigned F14BP_1:1;
  unsigned F14BP_2:1;
  unsigned F14BP_3:1;
  unsigned F15BP_0:1;
  unsigned F15BP_1:1;
  unsigned F15BP_2:1;
  unsigned F15BP_3:1;
} RXFBCON7bits;
extern volatile far  unsigned char       MSEL0;
extern volatile far  struct {
  unsigned FIL0_0:1;
  unsigned FIL0_1:1;
  unsigned FIL1_0:1;
  unsigned FIL1_1:1;
  unsigned FIL2_0:1;
  unsigned FIL2_1:1;
  unsigned FIL3_0:1;
  unsigned FIL3_1:1;
} MSEL0bits;
extern volatile far  unsigned char       MSEL1;
extern volatile far  struct {
  unsigned FIL4_0:1;
  unsigned FIL4_1:1;
  unsigned FIL5_0:1;
  unsigned FIL5_1:1;
  unsigned FIL6_0:1;
  unsigned FIL6_1:1;
  unsigned FIL7_0:1;
  unsigned FIL7_1:1;
} MSEL1bits;
extern volatile far  unsigned char       MSEL2;
extern volatile far  struct {
  unsigned FIL8_0:1;
  unsigned FIL8_1:1;
  unsigned FIL9_0:1;
  unsigned FIL9_1:1;
  unsigned FIL10_0:1;
  unsigned FIL10_1:1;
  unsigned FIL11_0:1;
  unsigned FIL11_1:1;
} MSEL2bits;
extern volatile far  unsigned char       MSEL3;
extern volatile far  struct {
  unsigned FIL12_0:1;
  unsigned FIL12_1:1;
  unsigned FIL13_0:1;
  unsigned FIL13_1:1;
  unsigned FIL14_0:1;
  unsigned FIL14_1:1;
  unsigned FIL15_0:1;
  unsigned FIL15_1:1;
} MSEL3bits;
extern volatile far  unsigned char       BSEL0;
extern volatile far  struct {
  unsigned :2;
  unsigned B0TXEN:1;
  unsigned B1TXEN:1;
  unsigned B2TXEN:1;
  unsigned B3TXEN:1;
  unsigned B4TXEN:1;
  unsigned B5TXEN:1;
} BSEL0bits;
extern volatile far  unsigned char       BIE0;
extern volatile far  struct {
  unsigned RXB0IE:1;
  unsigned RXB1IE:1;
  unsigned B0IE:1;
  unsigned B1IE:1;
  unsigned B2IE:1;
  unsigned B3IE:1;
  unsigned B4IE:1;
  unsigned B5IE:1;
} BIE0bits;
extern volatile far  unsigned char       TXBIE;
extern volatile far  struct {
  unsigned :2;
  unsigned TXB0IE:1;
  unsigned TXB1IE:1;
  unsigned TXB2IE:1;
} TXBIEbits;
extern volatile far  unsigned char       B0CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B0CONbits;
extern volatile far  unsigned char       B0SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B0SIDHbits;
extern volatile far  unsigned char       B0SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXIDE:1;
  };
} B0SIDLbits;
extern volatile far  unsigned char       B0EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B0EIDHbits;
extern volatile far  unsigned char       B0EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B0EIDLbits;
extern volatile far  unsigned char       B0DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned TXRTR:1;
  };
} B0DLCbits;
extern volatile far  unsigned char       B0D0;
extern volatile far  struct {
  unsigned B0D00:1;
  unsigned B0D01:1;
  unsigned B0D02:1;
  unsigned B0D03:1;
  unsigned B0D04:1;
  unsigned B0D05:1;
  unsigned B0D06:1;
  unsigned B0D07:1;
} B0D0bits;
extern volatile far  unsigned char       B0D1;
extern volatile far  struct {
  unsigned B0D10:1;
  unsigned B0D11:1;
  unsigned B0D12:1;
  unsigned B0D13:1;
  unsigned B0D14:1;
  unsigned B0D15:1;
  unsigned B0D16:1;
  unsigned B0D17:1;
} B0D1bits;
extern volatile far  unsigned char       B0D2;
extern volatile far  struct {
  unsigned B0D20:1;
  unsigned B0D21:1;
  unsigned B0D22:1;
  unsigned B0D23:1;
  unsigned B0D24:1;
  unsigned B0D25:1;
  unsigned B0D26:1;
  unsigned B0D27:1;
} B0D2bits;
extern volatile far  unsigned char       B0D3;
extern volatile far  struct {
  unsigned B0D30:1;
  unsigned B0D31:1;
  unsigned B0D32:1;
  unsigned B0D33:1;
  unsigned B0D34:1;
  unsigned B0D35:1;
  unsigned B0D36:1;
  unsigned B0D37:1;
} B0D3bits;
extern volatile far  unsigned char       B0D4;
extern volatile far  struct {
  unsigned B0D40:1;
  unsigned B0D41:1;
  unsigned B0D42:1;
  unsigned B0D43:1;
  unsigned B0D44:1;
  unsigned B0D45:1;
  unsigned B0D46:1;
  unsigned B0D47:1;
} B0D4bits;
extern volatile far  unsigned char       B0D5;
extern volatile far  struct {
  unsigned B0D50:1;
  unsigned B0D51:1;
  unsigned B0D52:1;
  unsigned B0D53:1;
  unsigned B0D54:1;
  unsigned B0D55:1;
  unsigned B0D56:1;
  unsigned B0D57:1;
} B0D5bits;
extern volatile far  unsigned char       B0D6;
extern volatile far  struct {
  unsigned B0D60:1;
  unsigned B0D61:1;
  unsigned B0D62:1;
  unsigned B0D63:1;
  unsigned B0D64:1;
  unsigned B0D65:1;
  unsigned B0D66:1;
  unsigned B0D67:1;
} B0D6bits;
extern volatile far  unsigned char       B0D7;
extern volatile far  struct {
  unsigned B0D70:1;
  unsigned B0D71:1;
  unsigned B0D72:1;
  unsigned B0D73:1;
  unsigned B0D74:1;
  unsigned B0D75:1;
  unsigned B0D76:1;
  unsigned B0D77:1;
} B0D7bits;
extern volatile far  unsigned char       CANSTAT_RO9;
extern volatile far  struct {
  unsigned ICODE0:1;
  unsigned ICODE1:1;
  unsigned ICODE2:1;
  unsigned ICODE3:1;
  unsigned ICODE4:1;
  unsigned OPMODE:1;
  unsigned REQOP1:1;
  unsigned REQOP2:1;
} CANSTAT_RO9bits;
